---
kind: method
id: M:Autodesk.Revit.DB.FabricationConfiguration.GetAllUsedServices
source: html/4a7b444f-9a43-5188-5ee4-d13debe21eec.htm
---
# Autodesk.Revit.DB.FabricationConfiguration.GetAllUsedServices Method

Returns all the used fabrication services. A service is used if any fabrication part in the service is created by user.

## Syntax (C#)
```csharp
public IList<FabricationService> GetAllUsedServices()
```

## Returns
All the used fabrication services.